Revit 2024 API
DefaultOpenFromCloudCallback Methods
The DefaultOpenFromCloudCallback type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
OnOpenConflict
 A method called when the conflict is happen during the model opening.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DefaultOpenFromCloudCallback Class
Autodesk.Revit.DB Namespace